Revit 2024 API
SpacingRule.SetLayoutMaximumSpacing Method
Set the Layout property to MaximumSpacing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetLayoutMaximumSpacing(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Visual Basic
Public Sub SetLayoutMaximumSpacing ( _
	distance As Double, _
	just As SpacingRuleJustification, _
	gridlinesRotation As Double, _
	offset As Double _
)
Visual C++
public:
void SetLayoutMaximumSpacing(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Parameters
distance
Type: System.Double
just
Type: Autodesk.Revit.DB.SpacingRuleJustification
gridlinesRotation
Type: System.Double
offset
Type: System.Double
Remarks
When changing the Layout to MaximumSpacing, you must also simultaneously set the Distance, Justification, GridlinesRotation, and Offset properties.
See Also
SpacingRule Class
Autodesk.Revit.DB Namespace